turbinesFoam/tests/tipCorrection/rotor/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     pimpleFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

// Two steps: the element CSV rows are compared between the tip-correction-on
// and tip-correction-off runs. The correction reads the previous iteration's
// relative velocity, so the second step (t = 0.002) is the one that carries
// the non-zero correction.
endTime         0.002;

deltaT          0.001;

writeControl    timeStep;

writeInterval   1;

purgeWrite      0;

writeFormat     ascii;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

libs
(
    "libturbinesFoam.so"
);

functions
{
    // Volume-integrate the turbine force field so the integrated load can be
    // compared between the augmentation on/off runs.
    forceIntegral
    {
        type            volFieldValue;
        libs            ("libfieldFunctionObjects.so");
        fields          (force.turbine);
        operation       volIntegrate;
        writeFields     false;
    }
}

// ************************************************************************* //
