turbinesFoam/tests/tipCorrection/rotor/system/fvOptions.axisdown
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2506                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

// Mirrored one-blade axial-flow rotor for the tip-correction convention
// test. Same geometry as `fvOptions` but with the rotor axis ALIGNED with the
// free stream (axis +x, free stream +x) and verticalDirection flipped so the
// blade still moves in +y. The local flow angle of paper Eq. 3 must be
// independent of this orientation. `fvOptions.axisdown` is `active off`;
// `fvOptions.axisdown.on` is `active on`.

turbine
{
    type            axialFlowTurbineALSource;
    active          on;

    axialFlowTurbineALSourceCoeffs
    {
        fieldNames          (U);
        selectionMode       cellSet;
        cellSet             turbine;
        origin              (0 0 0);
        axis                (1 0 0);
        verticalDirection   (0 0 -1);
        freeStreamVelocity  (10 0 0);
        tipSpeedRatio       5.0;
        rotorRadius         0.45;

        dynamicStall
        {
            active          off;
            dynamicStallModel LeishmanBeddoes;
        }

        endEffects
        {
            active          off;
            endEffectsModel Glauert;
        }

        tipCorrection
        {
            active          off;
            model           DagSorensen;
            wakeTurns       2;
            wakeAzimuthalStep 2;
            epsilon         0;
        }

        blades
        {
            blade1
            {
                writePerf           true;
                writeElementPerf    true;
                elementType         actuatorLineElement;
                nElements           6;
                elementProfiles     (S809 S809 S809 S809 S809 S809);
                elementData
                (
                    (0.0  0.05  0.0  0.04  0.25  0.0)
                    (0.0  0.45  0.0  0.04  0.25  0.0)
                );
            }
        }

        profileData
        {
            S809
            {
                data (#include "S809.dat");
            }
        }
    }
}

// ************************************************************************* //
